*** Simple Lambda pattern matching:
#+begin_src haskell
data Test = Something Int Int
let a = Test 5 3
let myFunc = \x -> case x of Something a b -> a + b
#+end_src

#+RESULTS:
: <interactive>:19:11: error:
:     parse error (possibly incorrect indentation or mismatched brackets)
: <interactive>:20:7: error: parse error on input ‘|’
: <interactive>:21:7: error: parse error on input ‘|’




*** Applicative
    Used with Maybe:
    #+begin_src haskell :results output
      Just (+3) <*> Just 9 -- unwrap and combine 
      Just (+3) *> Just 9  -- unwrap and discard left
      Just 7 <* Just 8     -- unwrap and discard right
      (+3) <$> Just 9      -- unwrap right, combine
      3 <$ Just 9          -- Unwrap right, only wrap left
    #+end_src

    #+RESULTS:
    : Just 12
    : Just 9
    : Just 7
    : Just 12




** Parsec Notes
   parsers as variables requires the flag -XFlexibleContexts
   use Text.Parsec, Text.Parsec.String, Text.Parsec.Char
   Text.Parsec.Char and Text.Parsec.String simplify types   

   *Simplest Parser*:
   #+begin_src haskell :results value
     import Text.Parsec as P
     let a = do { a <- P.many P.alphaNum; P.space; b <- P.many P.alphaNum; return [a,b] }
     let textToParse = "blah blee"
     let result = parse a "" textToParse
     putStrLn $ show result
    #+end_src

    #+RESULTS:
    : Right ["blah","blee"]
    spaces = many space
    word = many1 alphaNum <* spaces
    words = many1 word <* spaces
    num = do { a <- many digit <* spaces; return $ (read a :: Int) }

   Alternatives: 
   let dogOrCat = (string "dog") <|> (string "cat")

   <|> consumes input without backtracking, so
   let altFail = (string "abc") <|> (string "abd")
   Will fail as when the first attempt fails
   To fix, use *try*
   let altSucceed = try (string "abc") <|> (string "abd")



